In [1]:
import pandas as pd 
df=pd.read_csv('ALi.csv')

C:\Users\user\AppData\Local\Temp\ipykernel_15008\1584951722.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [15]:
df

  Unnamed: 0   NAME  AGE  MARKS
A      First  ADEEL   23     43
B     Second  BILAL   22     65
C      Third    ALI   21     76
D     Fourth   BABU   32     87
E      Fifth   NANU   45     97

In [14]:
df.index=('A','B','C','D','E')

In [19]:
df.loc['C']=['third','ali',24,43]

In [20]:
df

  Unnamed: 0   NAME  AGE  MARKS
A      First  ADEEL   23     43
B     Second  BILAL   22     65
C      third    ali   24     43
D     Fourth   BABU   32     87
E      Fifth   NANU   45     97